app/controllers/activities_controller.rb

INSERT INTO "activities" ("cathegory", "created_at", "date", "description", "duration", "id_creator", "id_location", "name", "privacy", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @activity = Activity.new(activity_params)
      @activity.id_creator = current_user.name
    respond_to do |format|
      if @activity.save

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_activity
      begin
        @activity = Activity.find(params[:id])